<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"9d5d44fb913cf81c54922676486d165817bd0a5029f86791ebd657e2c50dd3bc","plan_job_ref":"Job Plan org changes and list them in a PR #102 at https://github.com/django-commons/membership/actions/runs/15712715755","plan_out_hash":"495554e5145d5efdeb4d8d6cc25576881204297ff3a661bdc2bc9e120ef38212","plan_hash":"390f53d4ca729bceff2c50733e81724a5491fa249fae1ae1d47db7acf3862dd7","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 2 to import, 11 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_repository.this["django-prometheus"] will be updated in-place
  # (imported from "django-prometheus")
!~  resource "github_repository" "this" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
!~      allow_update_branch         = false -> true
+       archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
!~      delete_branch_on_merge      = false -> true
!~      description                 = "Export Django monitoring metrics for Prometheus.io" -> "Export Django monitoring metrics for Prometheus.io "
        etag                        = "W/\"d5b43118e2051fd13824ef7383a377d74f239d7d0bc769fbf73d234656040992\""
        full_name                   = "django-commons/django-prometheus"
        git_clone_url               = "git://github.com/django-commons/django-prometheus.git"
!~      has_discussions             = false -> true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
!~      has_wiki                    = true -> false
        homepage_url                = null
        html_url                    = "https://github.com/django-commons/django-prometheus"
        http_clone_url              = "https://github.com/django-commons/django-prometheus.git"
        id                          = "django-prometheus"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "django-prometheus"
        node_id                     = "********************************"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 33433092
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:django-commons/django-prometheus.git"
        svn_url                     = "https://github.com/django-commons/django-prometheus"
        topics                      = [
            "django",
            "django-prometheus",
            "exported-metrics",
            "metrics",
            "monitoring",
            "prometheus",
            "prometheus-client",
            "python",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_collaborators.this["django-prometheus"] will be updated in-place
  # (imported from "django-prometheus")
!~  resource "github_repository_collaborators" "this" {
        id             = "django-prometheus"
!~      invitation_ids = {} -> (known after apply)
        repository     = "django-prometheus"

        team {
            permission = "pull"
            team_id    = "*************"
        }
+       team {
+           permission = "admin"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "maintain"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "triage"
+           team_id    = (known after apply)
        }

-       user {
-           permission = "push" -> null
-           username   = "asherf" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "korfuri" -> null
        }
    }

  # github_repository_environment.pypi["django-prometheus"] will be created
+   resource "github_repository_environment" "pypi" {
+       can_admins_bypass   = true
+       environment         = "pypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-prometheus"

+       reviewers {
+           teams = (known after apply)
        }
    }

  # github_repository_environment.testpypi["django-prometheus"] will be created
+   resource "github_repository_environment" "testpypi" {
+       can_admins_bypass   = true
+       environment         = "testpypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-prometheus"
    }

  # github_team.repo_admin_team["django-prometheus"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the django-prometheus repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-prometheus-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["django-prometheus"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the django-prometheus repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-prometheus-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["django-prometheus"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the django-prometheus repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-prometheus"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["django-prometheus"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "asherf"
        }
    }

  # github_team_members.repo_team_members["django-prometheus"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "asherf"
        }
    }

  # github_team_repository.repo_admin_team_access["django-prometheus"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "django-prometheus"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["django-prometheus"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "django-prometheus"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["django-prometheus"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "django-prometheus"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["django-prometheus"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 2 to import, 11 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #102](https://github.com/django-commons/membership/actions/runs/15712715755)